// let musicLrcUrls = "../../static/lovemeorhim-Ruy.txt";
// 		function load(name) {
// 		    let xhr = new XMLHttpRequest(),
// 		        okStatus = document.location.protocol === "file:" ? 0 : 200;
// 		    xhr.open('GET', name, false);
// 		    xhr.overrideMimeType("text/html;charset=utf-8");//默认为utf-8
// 		    xhr.send(null);
// 		    return xhr.status === okStatus ? xhr.responseText : null;
// 		}
// 		// load(musicLrcUrls);
// 		let text = load(musicLrcUrls); 
		 
		// console.log(text);  //输出到浏览器控制器中
let data = [
	{
	"test": "[00:00.000] 作曲 : 陶喆,[00:01.000] 作词 : 娃娃+ 陶喆,[00:21.130]黑暗中的我们都没有说话,[00:27.631]你只想回家,[00:31.881]不想你回家,[00:36.131]寂寞深的像海太让人害怕,[00:42.381]温柔你的手,[00:45.881]轻轻揉着我的发,[00:50.131]你的眉眼说,[00:52.881]你好渴望我拥抱,[00:57.132]你身体却在拼命逃,[01:01.132]但欲望在燃烧,[01:09.382]你爱我还是他,[01:16.632]是不是真的他要比我好,[01:21.132]你为谁在挣扎,[01:24.882]你爱我还是他,[01:31.133]就说出你想说的真心话,[01:35.882]你到底要跟我还是他,[01:54.634]这是不是命运对我的惩罚,[02:01.384]爱你也没办法,[02:05.133]恨你也没办法,[02:09.134]陷在这个漩涡只想挣脱它,[02:15.634]拉住你的手,[02:18.884]却让我也被拖下,[02:23.134]你的眉眼说,[02:26.135]你不渴望我拥抱,[02:29.635]每当爱变成了煎熬,[02:33.635]你就开始要逃,[02:39.385]你爱我还是他,[02:45.635]是不是我可以做的更好,[02:50.135]让你不再挣扎,[02:53.885]你爱我还是他,[02:59.886]我宁愿听到残忍的回答,[03:04.636]也不要再被耍,[03:07.927]你爱我还是他,[03:14.177]我为你找了一百个理由,[03:18.927]我就是那么傻,[03:22.427]你爱我还是他,[03:29.178]是否沉默代替你的回答,[03:33.428]我应该明白吧,[04:11.429]你爱我还是他,[04:17.179]你都已看不到我们的好,[04:21.929]我还会心牵挂,[04:25.430]你爱我还是他,[04:31.929]是否沉默就是你的回答,[04:36.180]我们都别挣扎,[04:42.180]去爱他,"
	,
	"musicurl": "../../static/mp3/7031_4e97_47fb_3900347961cb48a32aaf060577ac7400.mp3"
	},
	
	]

module.exports = {
  data: data
}